package ru.ivakhramov.java.basic.homeworks.lesson20;

public class HomeworkLesson20Main {

    /**
     * Сервер: выполняет математические вычисления: +,-,*,/
     * Клиент-серверное взаимодействие:
     *
     *     клиент подключается к серверу, получает строку с доступными мат. операциями. Отображает ее пользователю.
     *     пользователь вводит два числа и команду в консоль
     *     отправляется запрос на сервер, сервер выполняет вычисления, возвращает результат клиенту.
     *     клиент отображает результат в консоль
     */
}
